[
	{
		"goal": "Everest Base Camp",
		"description": "I don't necessarily have the urge to climb there, but just imagine how amazing it would be if I had! Right?",
		"image": null,
		"thumb": null
	},
	{
		"goal": "Audience with the Pope and tour of Vatican City",
		"description": "I'd absolutely cherish the opportunity to tour Vatican City with the Pope. Despite not being particularly religious and intending no disrespect, I can't help but be fascinated by the immense influence and authority held by the Pope.",
		"image": null,
		"thumb": null
	},
	{
		"goal": "Write the next great Novel",
		"description": "I consider myself a skilled writer. Nevertheless, I grapple with 'stage fright' when it comes to sharing my work. I'm confident in my abilities; I just need to find my muse.",
		"image": null,
		"thumb": null
	},
	{
		"goal": "Walk the length of the Great Wall of China",
		"description": "The Great Wall of China has always captivated me, and if you inquire with anyone, they'll tell you that I have a genuine fondness for a delightful stroll.",
		"image": null,
		"thumb": null
	},
	{
		"goal": "In the realm of my dreams, I embark on a personal odyssey fueled by an eternal wonderer's childlike curiosity. As I navigate through the mystical landscapes of my subconscious, revered sites like Machu Picchu become gateways to profound insights encoded in the fabric of the Earth. Guided by an inner compass, this dream unfolds as a sacred journey, where each step reveals the timeless wisdom whispered by time itself. In this surreal quest, my insatiable thirst for knowledge transcends the boundaries of reality, transforming me from a mere dreamer into a seeker, unraveling the profound truths woven into the very essence of my being.",
		"image": null,
		"thumb": null
	},
	{
		"goal": "Light the Olympic Torch",
		"description": "I've already had the honor of participating in the Olympic Torch Relay back in 1996. Now, I dream of taking those final steps to carry the torch and ignite the flame.",
		"image": "images/olympics.png",
		"thumb": "images/olympics-thumb.png"
	},
	{
		"goal": "Claim the throne of Scotland",
		"description": "Technically, I possess a 1-acre plot of land in West Scotland. It's more of a whimsical claim than anything, but hey, I can boast a connection to the throne.",
		"image": "images/title.png",
		"thumb": "images/title-thumb.png"
	}
]
